/*

  Задание 1.
  Написать functional компонент, который будет выводить нам кнопку
  c определенными стилями, которая будет вполнять действие которое в
  неё передали.

*/
/*
  Задание 2.
  1. Получить в методе component componentDidMount данные с
  https://www.json-generator.com/
  2. Записать их в стейт по шаблону:
  {
    interviewed: false,
    user: { Элемент с jsonGenerator}
  }
  http://www.json-generator.com/api/json/get/cdZfJCjIia?indent=2

  3. Вывести их в виде списка, каждый элемент которого будет являтся
  Functional компонентом принимающим в себе обьект с прошлого пункта.

  Внури компонента должна быть вызвана функция, которая меняет значение
  interviewed с true на flase.
  Используя functional Component с задантя 1. (Button)

  Если оно true - выделить пункт зеленым,
  Если false - не выделять или выделить красным

*/
